podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/LPUART0_S32K14x.svd.xml
<!--
Devices using this peripheral: 
      S32K142
      S32K144
      S32K146
      S32K148
-->
      <peripheral>
         <?sourceFile "LPUART0_S32K14x" ?>
         <name>LPUART0</name>
         <description>Universal Asynchronous Receiver/Transmitter</description>
         <groupName>LPUART</groupName>
         <headerStructName>LPUART</headerStructName>
         <baseAddress>0x4006A000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>VERID</name>
               <description>Version ID Register</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetValue>0x4010003</resetValue>
               <fields>
                  <field>
                     <name>FEATURE</name>
                     <description>Feature Identification Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000000000000001</name>
                           <description>Standard feature set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0000000000000011</name>
                           <description>Standard feature set with MODEM/IrDA support</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MINOR</name>
                     <description>Minor Version Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAJOR</name>
                     <description>Major Version Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PARAM</name>
               <description>Parameter Register</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <resetValue>0x202</resetValue>
               <fields>
                  <field>
                     <name>TXFIFO</name>
                     <description>Transmit FIFO Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXFIFO</name>
                     <description>Receive FIFO Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GLOBAL</name>
               <description>LPUART Global Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>RST</name>
                     <description>Software Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Module is not reset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Module is reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PINCFG</name>
               <description>LPUART Pin Configuration Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>TRGSEL</name>
                     <description>Trigger Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Input trigger is disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Input trigger is used instead of RXD pin input</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Input trigger is used instead of CTS_B pin input</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Input trigger is used to modulate the TXD pin output. The TXD pin output (after TXINV configuration) is ANDed with the input trigger</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
